# -*- coding: utf-8 -*- 
# @Time : 2020/10/14 15:11 
# @Author : 张丽雯 
# @File : kuquData.py 
# @中文描述 :  库区管理
# -------------------------------------------正常场景测试数据----------------------------------------------
kuwei_code = 'kwc01'
kuwei_name = 'kwn01'
kuqu_code = 'kq01'
kuqu_name = 'xinzengnamekq'
add_code = 'kq02'
add_name = 'name02'
kuqu_editname = '修改库区名称'
# -------------------------------------------------------------------------------------------------------

# --------------------------------------------异常场景-编码异常---------------------------------------------
code1 = '1'  # 编码只有1位
code2 = 'code4'  # 编码超过4位
code3 = '2-co'  # 编码4位，但又特殊字符
code4 = ' '  # 编码为空
code5 = kuqu_code  # 编码重复
code_abnormal_list = [(code1, add_name), (code2, add_name), (code3, add_name), (code4, add_name), (code5, add_name)]
# ----------------------------------------------------------------------------------------------------------

# --------------------------------------------异常场景-名称异常-----------------------------------------------
name1 = '_name'  # 名称以特殊字符开头
name2 = 'name&q'  # 名称中含有特殊字符
name3 = '哈v进化成111哈v进哈v进化成111哈v进化成111哈v进化成111哈v进化成111哈v进化哈v进化成111哈v进哈v进化成111哈v进化成111哈v进化成111哈v进化成111哈v进化哈v进化成10'  # 字符数超过最大字符100
name4 = ' '  # 名称为空
name5 = kuqu_name  # 名称重复
add_name_abnormal_list = [(add_code, name1), (add_code, name2), (add_code, name3), (add_code, name4), (add_code, name5)]
edit_name_abnormal_list = [name1,name2,name3,name4,name5]
# ----------------------------------------------------------------------------------------------------------
