# -*- coding: utf-8 -*- 
# @Time : 2021/1/4 14:47 
# @Author : 张丽雯 
# @File : DeclarationData.py 
# @中文描述 :  生产声明

# -----------------------------------------正常场景----------------------------------------
num = '10'
Cnumber = '1'
# ----------------------------------------------------------------------------------------

# -------------------------------------异常场景-声明数量异常---------------------------------
num1 = 'a'  # 声明数量非数字
num2 = '10.0001'  # 声明数量小数位数超过3位
num3 = ' '  # 声明数量为空
num_abnormal_list = [
    (num1, Cnumber),
    (num2, Cnumber),
    (num3, Cnumber)
]
# -----------------------------------------------------------------------------------------

# -------------------------------------异常场景-声明容器数异常---------------------------------
Cnumber1 = 'a'  # 容器数非数字
Cnumber2 = '1.2'  # 容器数非整数
Cnumber3 = ' '  # 容器数为空
Cnumber4 = '1001'  # 容器数大于1000
Cnumber_abnormal_list = [
    (num, Cnumber1),
    (num, Cnumber2),
    (num, Cnumber3),
    (num, Cnumber4)
]
# -----------------------------------------------------------------------------------------
